---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.TextLabelType
source: html/fe768c86-d9d8-c56b-b2d2-38affa6da193.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.TextLabelType Property

Type of deformed shape text visualization.

## Syntax (C#)
```csharp
public AnalysisDisplayStyleDeformedShapeTextLabelType TextLabelType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration